/*
*********************************************************************************************************
*
*	模块名称 : 汉字点阵字库。有效显示区 高16x宽15, 最右一列留白
*	文件名称 : hz16.c
*	版    本 : V1.0
*	说    明 : 只包含本程序用到汉字字库
*	修改记录 :
*		版本号  日期       作者    说明
*		v1.0    2011-09-08 armfly  ST固件库V3.5.0版本。
*
*	Copyright (C), 2010-2011, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/


/*
	FLASH中内嵌小字库，只包括本程序用到的汉字点阵
	每行点阵数据，头2字节是汉子的内码，后面32字节是24点阵汉子的字模数据。
*/

unsigned char const g_Ascii32[] = 
{
	0x31,  0x00,0x00,0x00,0x00,0x00,0xC0,0x00,0xC0,0x01,0xC0,0x03,0xC0,0x0F,0xC0,0x01,0xC0,  // 1 //
			0x01,0xC0,0x01,0xC0,0x01,0xC0,0x01,0xC0,0x01,0xC0,0x01,0xC0,0x01,0xC0,0x01,0xC0,
			0x01,0xC0,0x01,0xC0,0x01,0xC0,0x01,0xC0,0x01,0xC0,0x01,0xC0,0x01,0xC0,0x01,0xC0,
			0x03,0xE0,0x0F,0xF8,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
	 
/* 最后一行必须用0xFF,0xFF结束，这是字库数组结束标志 */
0xFF,0xFF

};


unsigned char const g_Ascii32_VarWidth[] = 
{
// 土耳其C大写 //
0x43,0x17,  0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,
			0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0XFE,0X00,0X00,
			0X03,0XFF,0X80,0X00,0X07,0XFF,0XE0,0X00,0X0F,0XFF,0XE0,0X00,0X1F,0X83,0XF0,0X00,
			0X3E,0X00,0XF8,0X00,0X3C,0X00,0XF8,0X00,0X3C,0X00,0X60,0X00,0X78,0X00,0X00,0X00,
			0X78,0X00,0X00,0X00,0X78,0X00,0X00,0X00,0X78,0X00,0X00,0X00,0X78,0X00,0X00,0X00,
			0X78,0X00,0X00,0X00,0X78,0X00,0X60,0X00,0X7C,0X00,0X78,0X00,0X3C,0X00,0XF8,0X00,
			0X3E,0X01,0XF0,0X00,0X1F,0X83,0XF0,0X00,0X0F,0XFF,0XE0,0X00,0X07,0XFF,0XC0,0X00,
			0X03,0XFF,0X80,0X00,0X18,0XFE,0X00,0X00,0X0F,0XF0,0X00,0X00,0X07,0XE0,0X00,0X00,
			
//// 土耳其c小写 //
//0x63,0x12,  0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,
//			0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,
//			0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X00,
//			0X00,0X00,0X00,0X00,0X03,0XF8,0X00,0X00,0X0F,0XFE,0X00,0X00,0X1F,0XFF,0X00,0X00,
//			0X3E,0X1F,0X00,0X00,0X3C,0X0F,0X80,0X00,0X78,0X06,0X00,0X00,0X78,0X00,0X00,0X00,
//			0X78,0X00,0X00,0X00,0X78,0X00,0X00,0X00,0X78,0X00,0X00,0X00,0X78,0X00,0X00,0X00,
//			0X78,0X06,0X00,0X00,0X3C,0X0F,0X80,0X00,0X3E,0X1F,0X00,0X00,0X1F,0XFF,0X00,0X00,
//			0X0F,0XFE,0X00,0X00,0X43,0XF8,0X00,0X00,0X3F,0XC0,0X00,0X00,0X1F,0XC0,0X00,0X00,
			
/* 最后一行必须用0xFF,0xFF结束，这是字库数组结束标志 */
0xFF,0xFF

};

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/

