/*
*********************************************************************************************************
*
*	模块名称 : main模块
*	文件名称 : status_logic.h
*	版    本 : V1.0
*
*	Copyright (C), 2013-2014, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#ifndef _STATUS_LOGIC_H_
#define _STATUS_LOGIC_H_

void status_LogicMain(void);

#endif

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/

